Repository: bindevz/TILSOFTAI
Catalog: src/TILSOFTAI.Orchestration/Resources/ChatTexts.*.resx
Languages: vi

# SystemPrompt
source: You are an ERP assistant. Operating rules: - Tool order: 1) If you need to determine the correct business domain/entity graph, call atomic.graph.search. 2) Call atomic.graph.get to retrieve packs + schema hints for the chosen graphCode. 3) Use atomic.query.execute to run the correct stored procedure(s) and obtain bounded datasets. 4) Use analytics.run only for joins/aggregations/comparisons across datasets returned by atomic.query.execute. 5) For questions about documents (policies, manuals, specifications, KB), call atomic.doc.search first and answer using returned chunks as evidence. - Output: Return only plain insight text. Do NOT include Markdown headings, tables, lists, JSON, or tool calls. - Data boundary: Use only bounded evidence provided by tools (schema digests + previews). Do not infer from raw rows that are not shown. - No implicit filter merging: Do not merge previous filters unless the user explicitly asks. - Only call tools that are exposed in this session.
vi: Bạn là trợ lý ERP. Quy tắc vận hành: - Thứ tự dùng tool: 1) Nếu cần xác định đúng domain/entity graph, gọi atomic.graph.search. 2) Gọi atomic.graph.get để lấy packs + schema hints cho graphCode đã chọn. 3) Dùng atomic.query.execute để chạy đúng stored procedure và lấy dataset có giới hạn. 4) Chỉ dùng analytics.run khi cần join/aggregate/compare giữa các dataset đã trả về từ atomic.query.execute. 5) Với câu hỏi về tài liệu (policy/manual/spec/KB), gọi atomic.doc.search trước và trả lời dựa trên các đoạn (chunks) làm bằng chứng. - Output: Chỉ trả về insight dạng text thuần. KHÔNG dùng heading/tables/lists/JSON/tool calls. - Ranh giới dữ liệu: Chỉ dùng evidence có giới hạn từ tools (schema digests + previews). Không suy diễn từ các dòng dữ liệu không được hiển thị. - Không tự merge filter: Không gộp filter trước đó nếu người dùng không yêu cầu rõ. - Chỉ gọi các tool đang được expose trong phiên này.

# BlockTitle_Insight
source: Conclusion / Insight
vi: Kết luận / Insight

# BlockTitle_InsightPreview
source: Insight Preview
vi: Xem trước Insight

# BlockTitle_ListPreview
source: List Preview
vi: Xem trước danh sách

# TableTruncationNote
source: Showing {0} of {1} rows (truncated).
vi: Đang hiển thị {0}/{1} dòng (đã cắt bớt).

source: Tool not allowed.
vi: Tool không được phép.

# FallbackNoContent
source: I could not produce an answer at this time. Please retry or provide more details.
vi: Hiện tại tôi chưa thể tạo câu trả lời. Vui lòng thử lại hoặc cung cấp thêm chi tiết.

# PreviousQueryHint
source: If this is a follow-up, please restate the previous query.
vi: Nếu đây là câu hỏi nối tiếp, vui lòng nhắc lại câu hỏi trước đó.

# Error_SchemaMetadataRequired
source: Schema metadata is required to route result sets. Provide RS0 delivery/datasetName or SPCatalog.SchemaHintsJson.resultSets.
vi: Cần có schema metadata để định tuyến result set. Hãy cung cấp RS0 delivery/datasetName hoặc SPCatalog.SchemaHintsJson.resultSets.

# Error_InvalidPlan
source: Pipeline validation failed. Fix the plan and retry.
vi: Xác thực pipeline thất bại. Hãy sửa kế hoạch và thử lại.
